apache/nuttx/arch/arm/src/common/stm32/stm32_otgfshost_m3m4_v1.c
/* Register operations ******************************************************/

#ifdef CONFIG_STM32_USBHOST_REGDEBUG
static void stm32_printreg(uint32_t addr, uint32_t val, bool iswrite);
static void stm32_checkreg(uint32_t addr, uint32_t val, bool iswrite);
static uint32_t stm32_getreg(uint32_t addr);
static void stm32_putreg(uint32_t addr, uint32_t value);
#else
#  define stm32_getreg(addr)     getreg32(addr)
#  define stm32_putreg(addr,val) putreg32(val,addr)
#endif

static inline void stm32_modifyreg(uint32_t addr, uint32_t clrbits,
                                   uint32_t setbits);

#ifdef CONFIG_STM32_USBHOST_PKTDUMP
#  define stm32_pktdump(m,b,n) lib_dumpbuffer(m,b,n)
#else
#  define stm32_pktdump(m,b,n)
#endif

/* Byte stream access helper functions **************************************/

static inline uint16_t stm32_getle16(const uint8_t *val);

/* Channel management *******************************************************/

static int stm32_chan_alloc(struct stm32_usbhost_s *priv);
static inline void stm32_chan_free(struct stm32_usbhost_s *priv,
                                   int chidx);
static inline void stm32_chan_freeall(struct stm32_usbhost_s *priv);
static void stm32_chan_configure(struct stm32_usbhost_s *priv,
                                 int chidx);
static void stm32_chan_halt(struct stm32_usbhost_s *priv, int chidx,
                            enum stm32_chreason_e chreason);
static int stm32_chan_waitsetup(struct stm32_usbhost_s *priv,
                                struct stm32_chan_s *chan);
#ifdef CONFIG_USBHOST_ASYNCH
static int stm32_chan_asynchsetup(struct stm32_usbhost_s *priv,
                                  struct stm32_chan_s *chan,
                                  usbhost_asynch_t callback, void *arg);
#endif
static int stm32_chan_wait(struct stm32_usbhost_s *priv,
                           struct stm32_chan_s *chan);
static void stm32_chan_wakeup(struct stm32_usbhost_s *priv,
                              struct stm32_chan_s *chan);
static int stm32_ctrlchan_alloc(struct stm32_usbhost_s *priv,
                                uint8_t epno, uint8_t funcaddr,
                                uint8_t speed,
                                struct stm32_ctrlinfo_s *ctrlep);
static int stm32_ctrlep_alloc(struct stm32_usbhost_s *priv,
                              const struct usbhost_epdesc_s *epdesc,
                              usbhost_ep_t *ep);
static int stm32_xfrep_alloc(struct stm32_usbhost_s *priv,
                             const struct usbhost_epdesc_s *epdesc,
                             usbhost_ep_t *ep);

/* Control/data transfer logic **********************************************/

static void stm32_transfer_start(struct stm32_usbhost_s *priv,
                                 int chidx);
#if 0 /* Not used */
static inline uint16_t stm32_getframe(void);
#endif
static int stm32_ctrl_sendsetup(struct stm32_usbhost_s *priv,
                                struct stm32_ctrlinfo_s *ep0,
                                const struct usb_ctrlreq_s *req);
static int stm32_ctrl_senddata(struct stm32_usbhost_s *priv,
                               struct stm32_ctrlinfo_s *ep0,
                               uint8_t *buffer, unsigned int buflen);
static int stm32_ctrl_recvdata(struct stm32_usbhost_s *priv,
                               struct stm32_ctrlinfo_s *ep0,
                               uint8_t *buffer, unsigned int buflen);
static int stm32_in_setup(struct stm32_usbhost_s *priv, int chidx);
static ssize_t stm32_in_transfer(struct stm32_usbhost_s *priv, int chidx,
                                 uint8_t *buffer, size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void stm32_in_next(struct stm32_usbhost_s *priv,
                          struct stm32_chan_s *chan);
static int stm32_in_asynch(struct stm32_usbhost_s *priv, int chidx,
                           uint8_t *buffer, size_t buflen,
                           usbhost_asynch_t callback, void *arg);
#endif
static int stm32_out_setup(struct stm32_usbhost_s *priv, int chidx);
static ssize_t stm32_out_transfer(struct stm32_usbhost_s *priv,
                                  int chidx, uint8_t *buffer,
                                  size_t buflen);
#ifdef CONFIG_USBHOST_ASYNCH
static void stm32_out_next(struct stm32_usbhost_s *priv,
                           struct stm32_chan_s *chan);
static int stm32_out_asynch(struct stm32_usbhost_s *priv, int chidx,
                            uint8_t *buffer, size_t buflen,
                            usbhost_asynch_t callback, void *arg);
#endif

/* Interrupt handling *******************************************************/

/* Lower level interrupt handlers */

static void stm32_gint_wrpacket(struct stm32_usbhost_s *priv,
                                uint8_t *buffer, int chidx, int buflen);
static inline void stm32_gint_hcinisr(struct stm32_usbhost_s *priv,
                                      int chidx);
static inline void stm32_gint_hcoutisr(struct stm32_usbhost_s *priv,
                                       int chidx);
static void stm32_gint_connected(struct stm32_usbhost_s *priv);
static void stm32_gint_disconnected(struct stm32_usbhost_s *priv);

/* Second level interrupt handlers */

#ifdef CONFIG_STM32_OTGFS_SOFINTR
static inline void stm32_gint_sofisr(struct stm32_usbhost_s *priv);
#endif
static inline void stm32_gint_rxflvlisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_nptxfeisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_ptxfeisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_hcisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_hprtisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_discisr(struct stm32_usbhost_s *priv);
static inline void stm32_gint_ipxfrisr(struct stm32_usbhost_s *priv);

/* First level, global interrupt handler */

static int stm32_gint_isr(int irq, void *context, void *arg);

/* Interrupt controls */

static void stm32_gint_enable(void);
static void stm32_gint_disable(void);
static inline void stm32_hostinit_enable(void);
static void stm32_txfe_enable(struct stm32_usbhost_s *priv, int chidx);

/* USB host controller operations *******************************************/

